{
  "script": "/home/omen_pc1/photo_score_project/outputs/rgnet_float32_retry_20260508/scripts/finetune_rgnet_float32.py",
  "args": {
    "source_model": "outputs/rgnet_float32_retry_20260508/rgnet_float32_ava_pretrain/final_model.keras",
    "train_csv": "data/processed/aadb/train.csv",
    "val_csv": "data/processed/aadb/val.csv",
    "target_col": "score",
    "image_size": 256,
    "batch_size": 16,
    "epochs": 10,
    "learning_rate": 1e-05,
    "out_dir": "outputs/rgnet_float32_retry_20260508/rgnet_float32_ava_pretrain_aadb_finetune",
    "seed": 42,
    "verbose": 2,
    "overwrite": false
  },
  "tensorflow_version": "2.20.0",
  "visible_gpus": [
    "PhysicalDevice(name='/physical_device:GPU:0', device_type='GPU')"
  ],
  "mixed_precision_policy": "<DTypePolicy \"float32\">",
  "train_rows": 7612,
  "val_rows": 846,
  "epochs_completed": 10,
  "best_val_loss": 0.020968850702047348,
  "best_val_mae": 0.11363933235406876,
  "history": {
    "loss": [
      0.02772214636206627,
      0.02309991791844368,
      0.021405912935733795,
      0.020327847450971603,
      0.019915707409381866,
      0.018970467150211334,
      0.018650414422154427,
      0.0177031047642231,
      0.017096394672989845,
      0.016813509166240692
    ],
    "mae": [
      0.1328919231891632,
      0.11975613236427307,
      0.11481674760580063,
      0.11201298981904984,
      0.11039838939905167,
      0.10834979265928268,
      0.10693976283073425,
      0.10392060875892639,
      0.10244689881801605,
      0.10154733806848526
    ],
    "val_loss": [
      0.025357214733958244,
      0.02362173981964588,
      0.02236691117286682,
      0.02195020392537117,
      0.023758115246891975,
      0.022691799327731133,
      0.020968850702047348,
      0.027453681454062462,
      0.022031599655747414,
      0.02155282162129879
    ],
    "val_mae": [
      0.12800616025924683,
      0.12117507308721542,
      0.11737974733114243,
      0.11717694997787476,
      0.12228304892778397,
      0.11755648255348206,
      0.11363933235406876,
      0.1311226189136505,
      0.11544367671012878,
      0.11504693329334259
    ]
  },
  "dtype_summary_after_load": {
    "global_policy": "<DTypePolicy \"float32\">",
    "layer_count": 16,
    "weight_count": 373,
    "bad_mixed_float16_layers": [],
    "bad_non_float32_weights": [],
    "sample_layers": [
      {
        "name": "input_layer_1",
        "class_name": "InputLayer",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "efficientnetv2-b0",
        "class_name": "Functional",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_proj",
        "class_name": "Conv2D",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_nodes",
        "class_name": "Reshape",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_graph",
        "class_name": "RegionGraphBuilder",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "gcn_block_1",
        "class_name": "GraphConvolution",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "gcn_block_2",
        "class_name": "GraphConvolution",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_context",
        "class_name": "Concatenate",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_attention_logits",
        "class_name": "Dense",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_attention",
        "class_name": "Softmax",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_weighted_pool",
        "class_name": "RegionWeightedPooling",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "global_pool",
        "class_name": "GlobalAveragePooling2D",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "composition_fusion",
        "class_name": "Concatenate",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "dropout_2",
        "class_name": "Dropout",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "head_dense",
        "class_name": "Dense",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "score",
        "class_name": "Dense",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      }
    ]
  },
  "dtype_summary_after_training": {
    "global_policy": "<DTypePolicy \"float32\">",
    "layer_count": 16,
    "weight_count": 373,
    "bad_mixed_float16_layers": [],
    "bad_non_float32_weights": [],
    "sample_layers": [
      {
        "name": "input_layer_1",
        "class_name": "InputLayer",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "efficientnetv2-b0",
        "class_name": "Functional",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_proj",
        "class_name": "Conv2D",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_nodes",
        "class_name": "Reshape",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_graph",
        "class_name": "RegionGraphBuilder",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "gcn_block_1",
        "class_name": "GraphConvolution",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "gcn_block_2",
        "class_name": "GraphConvolution",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_context",
        "class_name": "Concatenate",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_attention_logits",
        "class_name": "Dense",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_attention",
        "class_name": "Softmax",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "region_weighted_pool",
        "class_name": "RegionWeightedPooling",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "global_pool",
        "class_name": "GlobalAveragePooling2D",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "composition_fusion",
        "class_name": "Concatenate",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "dropout_2",
        "class_name": "Dropout",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "head_dense",
        "class_name": "Dense",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      },
      {
        "name": "score",
        "class_name": "Dense",
        "dtype_policy": "float32",
        "compute_dtype": "float32",
        "variable_dtype": "float32"
      }
    ]
  },
  "artifacts": {
    "best_weights": "outputs/rgnet_float32_retry_20260508/rgnet_float32_ava_pretrain_aadb_finetune/best.weights.h5",
    "final_model": "outputs/rgnet_float32_retry_20260508/rgnet_float32_ava_pretrain_aadb_finetune/final_model.keras",
    "saved_model": "outputs/rgnet_float32_retry_20260508/rgnet_float32_ava_pretrain_aadb_finetune/saved_model",
    "training_history": "outputs/rgnet_float32_retry_20260508/rgnet_float32_ava_pretrain_aadb_finetune/training_history.csv"
  }
}
